uat_chat/AccumulationRegisters/уатОстаткиГСМнаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>уатОстаткиГСМнаТС</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦехаКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АЗС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Comment>Водитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЛ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Слив</Name>
					<Comment>1 - на ТС; 2 - на склад</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОборудованиеРаботыГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПластиковаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПластиковыеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БакОсновной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокПартии</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаправкаГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/AccumulationRegisters/уатОстаткиГСМнаТС/Ext/RecordSetModule.bsl
Перем РежимПроведения Экспорт; // Режим проведения документа. Если проведение неоперативное - проверок остатков нет
Перем ДокументОбъект Экспорт; //Документ, осуществляющий движение по регистру
Перем РезультатЗапросаПоГСМ Экспорт; //Выборка табличной части или таблица значений табличной части товаров
Перем ГраницаРасчетаОстатков Экспорт; // Момент времени, на который получаем остатки (партий) для списания с регистра
Перем ЗаписыватьДвижения Экспорт; // Булево. Истина - движения записываются сразу по окончании выполнения процедуры.
									//Ложь - движения записываются при записи документа.
Перем ТаблицаДляСписанияГСМ Экспорт; // Таблица списания ТС. Обязательна для заполнения.
Перем ТаблицаСтоимостиГСМПоСкладу Экспорт; // Таблица стоимости ГСМ. Заполняется при заправке со склада.


// Формирует движения по регистру расход
// Переменная вхСредняяЦена используется для документа "Слив ГСМ". По этой цене возвращается топлива на склад
//
// Возвращаемое значение: 
//  Истина       - Выполнение функции завершено успешно 
//  Ложь         - при выполнении функции возникли ошибки
//
Функция Расход() Экспорт
	
	ВсеОК = Истина;
	
	Для каждого СтрокаГСМ Из ТаблицаДляСписанияГСМ Цикл
		НоваяЗапись					= Добавить();
		НоваяЗапись.ВидДвижения		= ВидДвиженияНакопления.Расход;
		НоваяЗапись.Период			= ДокументОбъект.Дата;
		НоваяЗапись.Партия			= СтрокаГСМ.Партия;
		НоваяЗапись.Регистратор		= ДокументОбъект.Ссылка;
		НоваяЗапись.ТС				= СтрокаГСМ.ТС;
		НоваяЗапись.ГСМ				= СтрокаГСМ.ГСМ;
		НоваяЗапись.Количество		= СтрокаГСМ.Количество;
		НоваяЗапись.СтоимостьБух	= СтрокаГСМ.СтоимостьБух;	
		НоваяЗапись.СтоимостьУпр	= СтрокаГСМ.СтоимостьУпр;	
	КонецЦикла; 
		
	ДокументОбъект = Неопределено;
		
	Возврат ВсеОК;
	
КонецФункции

// Формирует движения по регистру приход
//
// Возвращаемое значение: 
//  Истина       - Выполнение функции завершено успешно 
//  Ложь         - при выполнении функции возникли ошибки
//
Функция Приход() Экспорт
	ВсеОК=Истина;
	//мВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	// получим таблицу ГСМ
	Если (РезультатЗапросаПоГСМ=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоГСМ)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоГСМ)<>Тип("ТаблицаЗначений")) Тогда
		ВсеОК = Ложь;
		Возврат Ложь;
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоГСМ)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоГСМ=РезультатЗапросаПоГСМ.Выгрузить();
	КонецЕсли;
	
	//Преребераем строки ГСМ
	Для каждого СтрокаГСМ Из РезультатЗапросаПоГСМ Цикл
		Если СтрокаГСМ.Количество <> 0 Тогда
			НоваяЗапись				= Добавить();
			НоваяЗапись.ВидДвижения	= ВидДвиженияНакопления.Приход;
			Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.уатЗаправкаГСМ")
				И (НЕ СтрокаГСМ.ПутевойЛист.Пустая())
				И НачалоДня(СтрокаГСМ.ПутевойЛист.ДатаВыезда) = НачалоДня(СтрокаГСМ.Дата) Тогда
				НоваяЗапись.Период = СтрокаГСМ.ПутевойЛист.ДатаВыезда;
			Иначе
				НоваяЗапись.Период = СтрокаГСМ.Дата;
			КонецЕсли;
			НоваяЗапись.Регистратор	= ДокументОбъект.Ссылка;
			НоваяЗапись.Партия		= ДокументОбъект.Ссылка;
			НоваяЗапись.ТС			= СтрокаГСМ.ТС;
			НоваяЗапись.ГСМ			= СтрокаГСМ.ГСМ;
			НоваяЗапись.Количество	= СтрокаГСМ.Количество;
			
			////если была заправка со склада предприятия, то стоимость возьмем из готовой таблицы
			//Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.уатЗаправкаГСМ") Тогда
			//	Если ДокументОбъект.ВидДвиженияГСМ = Перечисления.уатВидыДвиженияГСМ.ЗаправкаСклад Или
			//		ДокументОбъект.ВидДвиженияГСМ = Перечисления.уатВидыДвиженияГСМ.ЗаправкаТалоны Тогда
			//		
			//		мСтрока = ТаблицаСтоимостиГСМПоСкладу.Найти(СтрокаГСМ.ГСМ, "НоменклатураГСМ");
			//		Если мСтрока <> Неопределено Тогда
			//			Если мСтрока.СписываемоеКоличествоГСМ <> 0 Тогда
			//				НоваяЗапись.СтоимостьБух = СтрокаГСМ.Количество * мСтрока.Сумма / мСтрока.СписываемоеКоличествоГСМ;
			//			Иначе
			//				НоваяЗапись.СтоимостьБух = 0;
			//			КонецЕсли;	
			//		Иначе
			//			НоваяЗапись.СтоимостьБух = 0;
			//		КонецЕсли;
			//	Иначе    // не со склада
			//		НоваяЗапись.СтоимостьБух= уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СтрокаГСМ.СуммаБезНДС,
			//			СтрокаГСМ.Валюта, мВалютаРегламентированногоУчета, СтрокаГСМ.Дата, СтрокаГСМ.Дата);	
			//	КонецЕсли;
			//	
			//Иначе      // не заправка
			
				Если РезультатЗапросаПоГСМ.Колонки.Найти("СуммаБезНДС") <> Неопределено Тогда
					НоваяЗапись.СтоимостьБух= уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СтрокаГСМ.СуммаБезНДС, СтрокаГСМ.Валюта, мВалютаРегламентированногоУчета, СтрокаГСМ.Дата, СтрокаГСМ.Дата);	
				Иначе
					НоваяЗапись.СтоимостьБух= уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СтрокаГСМ.Сумма, СтрокаГСМ.Валюта, мВалютаРегламентированногоУчета, СтрокаГСМ.Дата, СтрокаГСМ.Дата);	
				КонецЕсли;	
				
			//КонецЕсли; 
			НоваяЗапись.СтоимостьУпр= НоваяЗапись.СтоимостьБух;
		КонецЕсли; 
	КонецЦикла; 
	
	// запись движений
	Если ВсеОК Тогда
		Записать();
	КонецЕсли; 
	
	ДокументОбъект = Неопределено;
	
	Возврат ВсеОК;
КонецФункции

Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияТиповые.уатПроверкаПериодаЗаписей(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры


//=================================================================================
//Инициализация переменных модуля набора записей

РежимПроведения=РежимПроведенияДокумента.Оперативный;

ДокументОбъект=Неопределено; // !!! Обязательный к заполнению перед началом проведения
РезультатЗапросаПоГСМ=Неопределено;
ГраницаРасчетаОстатков=Неопределено;
